In [1]:
my_grades = ["B","C","B","D"]

In [2]:
import pandas as pd
my_grades = pd.Series(my_grades)

In [3]:
my_grades

0    B
1    C
2    B
3    D
dtype: object

In [7]:
my_grades.map({"B":"A","C":"B","B":"A","D":"C"})

0    A
1    B
2    A
3    C
dtype: object

In [8]:
my_grades = [92.34, 84.56, 86.78, 98.32]

In [9]:
for grade in my_grades:
    print("{:.0f}".format(grade))

92
85
87
98

In [10]:
my_grades = pd.Series([92.34, 84.56, 86.78, 78.32])
my_grades

0    92.34
1    84.56
2    86.78
3    78.32
dtype: float64

In [11]:
my_grades.map("{:.0f}".format)

0    92
1    85
2    87
3    78
dtype: object

In [13]:
df = pd.DataFrame()

In [14]:
df

Empty DataFrame
Columns: []
Index: []

In [19]:
df['id'] = pd.Series([1,2,3,4,5])
df['HP'] = pd.Series([4,10,17,60,65])
df['MP'] = pd.Series([10,11,19,22,100])

In [20]:
df

   id  HP   MP
0   1   4   10
1   2  10   11
2   3  17   19
3   4  60   22
4   5  65  100

In [21]:
new_order = ['MP',"HP"]

In [22]:
df = df[new_order]
df

    MP  HP
0   10   4
1   11  10
2   19  17
3   22  60
4  100  65